app/controllers/chefs_controller.rb

  def index
  	@chefs = Chef.paginate(page: params[:page], per_page: 4)
---
SELECT  "chefs".* FROM "chefs" LIMIT 4 OFFSET 0
SELECT COUNT(*) FROM "chefs"

  def create
  	@chef = Chef.new(chef_params)
  	if @chef.save
---
INSERT INTO "chefs" ("chefname", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def show
  	@recipes = Recipe.paginate(page: params[:page], per_page: 3)
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."chef_id" = ?  ORDER BY "recipes"."updated_at" DESC  [["chef_id", 1]]
SELECT COUNT(*) FROM "recipes"

  def update
  	if @chef.update(chef_params)
---
UPDATE "chefs" SET "chefname" = ?, "password_digest" = ?, "updated_at" = ? WHERE "chefs"."id" = ?  [["chefname", "Patrick Medeiros"], ["password_digest", "$2a$10$RiI37YdeKI5Vlm0WYSMwBO/cQzKVBTAOQ3o3JDLYFLxZeBc8BqWNe"], ["updated_at", "2016-01-27 19:13:50.155841"], ["id", 3]]

  	def find_chef
  	  @chef = Chef.find(params[:id])
---
SELECT  "chefs".* FROM "chefs" WHERE "chefs"."id" = ? LIMIT 1  [["id", 3]]