app/controllers/recipes_controller.rb

  def index
  	@recipes = Recipe.paginate(page: params[:page], per_page: 4)
---
SELECT  "recipes".* FROM "recipes"  ORDER BY "recipes"."updated_at" DESC LIMIT 4 OFFSET 0
SELECT COUNT(*) FROM "recipes"

  def create
  	@recipe = Recipe.new(recipe_params)
  	@recipe.chef = current_user
  	if @recipe.save
---
INSERT INTO "recipes" ("name", "summary", "description", "picture", "chef_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
  	if @recipe.update(recipe_params)
---
UPDATE "recipes" SET "name" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["name", "Vegetable"], ["updated_at", "2016-01-20 14:32:14.461513"], ["id", 2]]

  def like
    like = Like.create(like: params[:like], chef: current_user, recipe: @recipe)
---
INSERT INTO "likes" ("like", "chef_id", "recipe_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["like", "t"], ["chef_id", 1], ["recipe_id", 2], ["created_at", "2016-01-27 14:39:54.871998"], ["updated_at", "2016-01-27 14:39:54.871998"]]

  	def find_recipe
  	  @recipe = Recipe.find(params[:id])
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ?  ORDER BY "recipes"."updated_at" DESC LIMIT 1  [["id", 8]]